---
kind: type
id: T:Autodesk.Revit.DB.ImagePlacementOptions
source: html/20d793a0-4309-dac8-1e43-61d275237887.htm
---
# Autodesk.Revit.DB.ImagePlacementOptions

ImagePlacementOptions are used to describe where an ImageInstance should be placed in a view

## Syntax (C#)
```csharp
public class ImagePlacementOptions : IDisposable
```